Tekla Open API Reference for Tekla Structures 2025
AnalysisNode.GetAnalysisParts Method
 Get analysis parts connected to node.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisObjectEnumerator GetAnalysisParts()
Public Function GetAnalysisParts As AnalysisObjectEnumerator
Return Value
Type: AnalysisObjectEnumerator
Enumerator of analysis parts connected to node.
See Also
Reference
AnalysisNode Class
Tekla.Structures.Analysis Namespace